### Getting a general view of DataFrame

When we analysed the data from the website we got to know that some companies salary is in per month basis some in per hour basis and some in per year basis. So we are trying to bring uniformity in the data by converting all the salary ranges in per year basis.

In [433]:
import pandas as pd

In [434]:
df = pd.read_csv('job_trends.csv')

In [435]:
df.head()

,company_name,job_role,job_location,salary,skills,company_rating
0,BigSpire Software,Artificial Intelligence Researcher - Freshers,India,NaN,"Analysis skills, AI, Communication skills",3.9
1,Recode Minds,Research Associate – Artificial Intelligence,Hyderābād,₹3L - ₹8L (Glassdoor Est.),"TensorFlow, MATLAB, Data mining, R, Math",NaN
2,cloudsek,Threat Intelligence Researcher,Delhi,NaN,"Encryption, Machine learning, Cybersecurity, C...",3.8
3,Bosch Group,Researcher: Modelling and Simulations,Bengaluru,₹2L - ₹4L (Glassdoor Est.),"Image processing, Research, C++, Math, C",4.1
4,Microsoft,Researcher - Machine Learning and AI,Bengaluru,₹6L - ₹8L (Glassdoor Est.),"Machine learning, Natural language processing, AI",4.2

### Removing Duplicates

In [437]:
df.isnull().sum()

company_name         0
job_role             0
job_location         0
salary            4870
skills             425
company_rating    6423
dtype: int64

In [438]:
df.duplicated().sum()

2900

In [439]:
df = df.drop_duplicates()

In [440]:
df.duplicated().sum()

0

In [441]:
df.isnull().sum()

company_name         0
job_role             0
job_location         0
salary            4212
skills             405
company_rating    5572
dtype: int64

### Converting the dataframe columns into desired Datatype

In [443]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16952 entries, 0 to 19851
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_name    16952 non-null  object
 1   job_role        16952 non-null  object
 2   job_location    16952 non-null  object
 3   salary          12740 non-null  object
 4   skills          16547 non-null  object
 5   company_rating  11380 non-null  float64
dtypes: float64(1), object(5)
memory usage: 927.1+ KB

In [444]:
df['company_rating'] = df['company_rating'].astype('float')

In [445]:
df['company_name'] = df['company_name'].astype('string')

In [446]:
df['job_role'] = df['job_role'].astype('string')

In [447]:
df['skills'] = df['skills'].astype('string')

In [448]:
df['job_location'] = df['job_location'].astype('string')

In [449]:
df.rename(columns = {'salary':'salary_pa'}, inplace = True)

In [450]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16952 entries, 0 to 19851
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_name    16952 non-null  string
 1   job_role        16952 non-null  string
 2   job_location    16952 non-null  string
 3   salary_pa       12740 non-null  object
 4   skills          16547 non-null  string
 5   company_rating  11380 non-null  float64
dtypes: float64(1), object(1), string(4)
memory usage: 927.1+ KB

In [451]:
df.head()

,company_name,job_role,job_location,salary_pa,skills,company_rating
0,BigSpire Software,Artificial Intelligence Researcher - Freshers,India,NaN,"Analysis skills, AI, Communication skills",3.9
1,Recode Minds,Research Associate – Artificial Intelligence,Hyderābād,₹3L - ₹8L (Glassdoor Est.),"TensorFlow, MATLAB, Data mining, R, Math",NaN
2,cloudsek,Threat Intelligence Researcher,Delhi,NaN,"Encryption, Machine learning, Cybersecurity, C...",3.8
3,Bosch Group,Researcher: Modelling and Simulations,Bengaluru,₹2L - ₹4L (Glassdoor Est.),"Image processing, Research, C++, Math, C",4.1
4,Microsoft,Researcher - Machine Learning and AI,Bengaluru,₹6L - ₹8L (Glassdoor Est.),"Machine learning, Natural language processing, AI",4.2

### Converting Salary ranges to average Salary in Per Annum (PA)

#### Let us check what alphanumeric characters are present in salary column except for numbers

In [454]:
df['salary_words'] = df['salary_pa'].str.extractall(r'([a-zA-Z]+(?: [a-zA-Z]+)*)').groupby(level=0).agg(' '.join)

In [455]:
df['salary_words'].value_counts()

salary_words
L L Glassdoor Est        5955
T T Employer Est         2356
L L Employer Est         2070
L Employer Est            566
T Employer Est            540
K K Glassdoor est         404
L Glassdoor Est           385
K K Employer est          105
T L Employer Est           82
Per hour Employer Est      81
T L Glassdoor Est          43
M Employer est             32
M M Employer est           31
K M Employer est           31
K Employer est             26
K M Glassdoor est          14
T T Glassdoor Est          10
K Glassdoor est             3
T Glassdoor Est             3
Per Hour Employer est       2
M Glassdoor est             1
Name: count, dtype: int64

### In the above code we view the alphabets and words that are used in the salary column and deal with them accordingly.

In [457]:
df['salary_pa'] = df['salary_pa'].str.replace(r'\s*\((Glassdoor|Employer) (Est|est)\.\)', '', regex=True)

In [458]:
df['salary_words'] = df['salary_pa'].str.extractall(r'([a-zA-Z]+(?: [a-zA-Z]+)*)').groupby(level=0).agg(' '.join)

In [459]:
df['salary_words'].value_counts()

salary_words
L L         8025
T T         2366
L            951
T            543
K K          509
T L          125
Per hour      81
K M           45
M             33
M M           31
K             29
Per Hour       2
Name: count, dtype: int64

In [460]:
df.loc[(df['salary_words'] == 'T L' )| (df['salary_words'] == 'K M'), 'salary_pa'] = df.loc[(df['salary_words'] == 'T L') | (df['salary_words'] == 'K M'), 'salary_pa'].apply(lambda x: str(x).replace('L', '*1200000').replace('M', '12000000'))

In [461]:
df['salary_pa'] = (
                    df['salary_pa']
                    .str.replace('₹', '', regex = False)
                    .str.replace('L', '*100000', regex = False)
                    .str.replace('T', '*12000', regex = False)
                    .str.replace('K', '*12000', regex  = False)
                    .str.replace('Per hour', '*1920', regex = False)
                    .str.replace('Per Hour', '*1920', regex = False)
                    .str.replace('M', '*1000000', regex = False)
                    
                   )

In [462]:
df['salary_pa']

0                        NaN
1        3*100000 - 8*100000
2                        NaN
3        2*100000 - 4*100000
4        6*100000 - 8*100000
                ...
19847                    NaN
19848    2*100000 - 7*100000
19849    4*100000 - 6*100000
19850    3*100000 - 4*100000
19851                    NaN
Name: salary_pa, Length: 16952, dtype: object

### Now lets check if there are any other alphanumeric characters left in salary column

In [464]:
df['salary_words'] = df['salary_pa'].str.extractall(r'([a-zA-Z]+(?: [a-zA-Z]+)*)').groupby(level=0).agg(' '.join)

In [465]:
df['salary_words'].value_counts()

Series([], Name: count, dtype: int64)

### Since there are no other words we are good to go.

#### Handling NaN values

In [468]:
df['salary_pa'] = df['salary_pa'].fillna(0)

In [469]:
df[['min_salary_pa', 'max_salary_pa']] = df['salary_pa'].str.split('-', expand = True)

In [470]:
df.head()

,company_name,job_role,job_location,salary_pa,skills,company_rating,salary_words,min_salary_pa,max_salary_pa
0,BigSpire Software,Artificial Intelligence Researcher - Freshers,India,0,"Analysis skills, AI, Communication skills",3.9,NaN,NaN,NaN
1,Recode Minds,Research Associate – Artificial Intelligence,Hyderābād,3*100000 - 8*100000,"TensorFlow, MATLAB, Data mining, R, Math",NaN,NaN,3*100000,8*100000
2,cloudsek,Threat Intelligence Researcher,Delhi,0,"Encryption, Machine learning, Cybersecurity, C...",3.8,NaN,NaN,NaN
3,Bosch Group,Researcher: Modelling and Simulations,Bengaluru,2*100000 - 4*100000,"Image processing, Research, C++, Math, C",4.1,NaN,2*100000,4*100000
4,Microsoft,Researcher - Machine Learning and AI,Bengaluru,6*100000 - 8*100000,"Machine learning, Natural language processing, AI",4.2,NaN,6*100000,8*100000

In [471]:
df['min_salary_pa'] = df['min_salary_pa'].fillna(0)
df['max_salary_pa'] = df['max_salary_pa'].fillna(0)

In [472]:
df['min_salary_pa'] = df['min_salary_pa'].astype('str')

In [473]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16952 entries, 0 to 19851
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   company_name    16952 non-null  string
 1   job_role        16952 non-null  string
 2   job_location    16952 non-null  string
 3   salary_pa       16952 non-null  object
 4   skills          16547 non-null  string
 5   company_rating  11380 non-null  float64
 6   salary_words    0 non-null      object
 7   min_salary_pa   16952 non-null  object
 8   max_salary_pa   16952 non-null  object
dtypes: float64(1), object(4), string(4)
memory usage: 1.3+ MB

### Checking for any non printable characters

In [475]:
import re
def cleanstring(s):
    return re.sub(r'[\x00-\x1F\x7F\xA0]', '', s)

In [476]:
df['min_salary_pa'] = df['min_salary_pa'].astype('str').apply(cleanstring)
df['max_salary_pa'] = df['max_salary_pa'].astype('str').apply(cleanstring)

In [477]:
df['min_salary_pa'] = df['min_salary_pa'].apply(eval)
df['max_salary_pa'] = df['max_salary_pa'].apply(eval)

In [478]:
df.head()

,company_name,job_role,job_location,salary_pa,skills,company_rating,salary_words,min_salary_pa,max_salary_pa
0,BigSpire Software,Artificial Intelligence Researcher - Freshers,India,0,"Analysis skills, AI, Communication skills",3.9,NaN,0,0
1,Recode Minds,Research Associate – Artificial Intelligence,Hyderābād,3*100000 - 8*100000,"TensorFlow, MATLAB, Data mining, R, Math",NaN,NaN,300000,800000
2,cloudsek,Threat Intelligence Researcher,Delhi,0,"Encryption, Machine learning, Cybersecurity, C...",3.8,NaN,0,0
3,Bosch Group,Researcher: Modelling and Simulations,Bengaluru,2*100000 - 4*100000,"Image processing, Research, C++, Math, C",4.1,NaN,200000,400000
4,Microsoft,Researcher - Machine Learning and AI,Bengaluru,6*100000 - 8*100000,"Machine learning, Natural language processing, AI",4.2,NaN,600000,800000

### Calculating the salary as the average of min_salary and max_salary

In [480]:
df['min_salary_pa'] = pd.to_numeric(df['min_salary_pa'], errors='coerce')
df['max_salary_pa'] = pd.to_numeric(df['max_salary_pa'], errors='coerce')

In [481]:
df['salary_pa'] = (df['min_salary_pa'] + df['max_salary_pa'])//2

In [482]:
df.head()

,company_name,job_role,job_location,salary_pa,skills,company_rating,salary_words,min_salary_pa,max_salary_pa
0,BigSpire Software,Artificial Intelligence Researcher - Freshers,India,0.0,"Analysis skills, AI, Communication skills",3.9,NaN,0.0,0.0
1,Recode Minds,Research Associate – Artificial Intelligence,Hyderābād,550000.0,"TensorFlow, MATLAB, Data mining, R, Math",NaN,NaN,300000.0,800000.0
2,cloudsek,Threat Intelligence Researcher,Delhi,0.0,"Encryption, Machine learning, Cybersecurity, C...",3.8,NaN,0.0,0.0
3,Bosch Group,Researcher: Modelling and Simulations,Bengaluru,300000.0,"Image processing, Research, C++, Math, C",4.1,NaN,200000.0,400000.0
4,Microsoft,Researcher - Machine Learning and AI,Bengaluru,700000.0,"Machine learning, Natural language processing, AI",4.2,NaN,600000.0,800000.0

In [483]:
df = df.drop(columns = ['min_salary_pa', 'max_salary_pa', 'salary_words']).reset_index()

### Converting per month salaries to per year

In [485]:
df.loc[df['salary_pa'] <= 100000, 'salary_pa']*= 12

In [486]:
df.sample(10)

,index,company_name,job_role,job_location,salary_pa,skills,company_rating
14410,16794,Microsoft,Software Engineering,Bengaluru,600000.0,"Azure, C#, Microsoft Office, .NET, Algorithm d...",4.2
6986,7453,Adobe,Member of Technical Staff II,Noida,0.0,"Computer science, Data structures, Windows, Ap...",4.2
8953,9742,AGAADH GAMES,Sound Designer,India,270000.0,"Unity, Middleware, Communication skills",NaN
12631,14276,Coelentera Technologies,Product Manager,Hyderābād,700000.0,"Business analysis, Product management, Supply ...",NaN
10126,11024,symbiosis e-serve,IT Sales Specialist,Pune,800000.0,"Market analysis, Sales, Upselling, Lead genera...",NaN
6653,7113,ROBOSOFT TECHNOLOGIES PRIVATE LIMITED,Simulation Engineer,Bengaluru,0.0,"MATLAB, C++, C, Scripting, Unit testing",NaN
2852,2905,MindTrilogy IT Solutions Pvt. Ltd,Data Engineer,Remote,780000.0,"Git, SQL, Machine learning, Scrum, Agile",NaN
10735,11880,Kotai Electronics Pvt Ltd,Machine Learning Engineer,India,240000.0,"TensorFlow, CI/CD, Image processing, Azure, Ku...",NaN
5930,6378,The Student Care,Digital Marketing Specialist,India,180000.0,"Graphic design, Project management, Content cr...",NaN
1762,1781,Workday,Business Intelligence Systems Engineer,Pune,450000.0,"Power BI, Business intelligence, R, Alteryx, D...",4.1

In [487]:
df.loc[df['company_rating'] >= 3.5, 'salary_pa']*= 12

In [488]:
df.sample(10)

,index,company_name,job_role,job_location,salary_pa,skills,company_rating
5870,6318,CenturySoft Pvt Ltd,Digital Marketing Manager,Pune,1200000.0,"Management, Social media marketing, Social med...",2.4
7318,7831,Crowdnetic Technologies Private Limited,Web flow Developer,India,500000.0,"CSS, Responsive web design, CMMS, JavaScript, ...",NaN
16489,19367,AKACORP INNOVATIVE TECHNOLOGY & TRADE PRIVATE ...,UI/UX Designer,Noida,600000.0,"Responsive web design, Wireframing, Adobe XD, ...",NaN
9099,9918,TILTLABS,"Unity Roblox, Blender Developers",India,0.0,"2D animation, Unity, Digital art",3.0
8163,8874,Provisions FZCO,Full Stack Developer (3D Modeling),Remote,0.0,"Authentication, Node.js, CSS, Git, English",NaN
7657,8261,Spruko Technologies,Node.js Developer,India,0.0,Node.js,5.0
6146,6594,EbisHr Services Private Limited,Digital Marketing Specialist,Cannanore,270000.0,"Facebook Advertising, Digital marketing, Desig...",NaN
2212,2244,Jade Global,AI/ML Engineers,Pune,5400000.0,"TensorFlow, CI/CD, Cloud infrastructure, Softw...",3.7
4568,4826,Thoughtquad,Oracle SOA Admin,Bengaluru,7200000.0,"Oracle, Ant, Software deployment, J2EE, Weblogic",NaN
16813,19707,Userfacet,Sr. UI / UX Designer,Bengaluru,0.0,Communication skills,4.8

In [489]:
df.to_csv('cleaned_job_trends.csv', index = False)

In [539]:
df.shape

(16952, 7)